УправлениеСдачейКвартир/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеСдачейКвартир/src/Enums/ВидДоговора/ВидДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДоговора</name>
  <enumValues>
    <name>САрендодателем</name>
  </enumValues>
  <enumValues>
    <name>САрендатором</name>
  </enumValues>
</mdclass:Enum>

УправлениеСдачейКвартир/src/Catalogs/Договоры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверкаВидаДоговора();
	
	УстановкаЦеныНаКвартиру()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	УстановкаЦеныНаКвартиру();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПроверкаВидаДоговора();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаВидаДоговора()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидДоговора.САрендатором") Тогда
		Элементы.Цена.Заголовок = "Цена за сутки";
	Иначе
		Элементы.Цена.Заголовок = "Цена";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦеныНаКвартиру()

	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);

КонецПроцедуры

#КонецОбласти
